In [39]:
import pandas as pd

In [40]:
f = '~/Downloads/finance - Sheet1.csv'
df = pd.read_csv(f)
df

                  Expenses  Year 1  Year 2  Year 3  Year 4  Year 5
0  Costs of Goods/Services   31616   47500   64616   92563  149569
1    Marketing/Advertising    1005     500     500     500     500
2         Restaurant Space   36000   36000   36000   36000   36000
3           Salaries/Wages  100000  120000  120000  200000  300000
4                Equipment    5000    2000    2000    2000    2000
5                Utilities    1250    1250    1250    1250    1250

In [41]:
# find total expenses for each year
# find total expense in 5 years
year_1_total = sum(df['Year 1'])
year_1_total
df.loc[6, :] = ['Totals', 174871, 0, 0, 0, 0]

In [42]:
df

                  Expenses    Year 1    Year 2    Year 3    Year 4    Year 5
0  Costs of Goods/Services   31616.0   47500.0   64616.0   92563.0  149569.0
1    Marketing/Advertising    1005.0     500.0     500.0     500.0     500.0
2         Restaurant Space   36000.0   36000.0   36000.0   36000.0   36000.0
3           Salaries/Wages  100000.0  120000.0  120000.0  200000.0  300000.0
4                Equipment    5000.0    2000.0    2000.0    2000.0    2000.0
5                Utilities    1250.0    1250.0    1250.0    1250.0    1250.0
6                   Totals  174871.0       0.0       0.0       0.0       0.0

In [55]:
df.drop('Expenses', axis=1).sum().sum()

KeyError: "['Expenses'] not found in axis"

In [44]:
#creating a dataframe
df = pd.DataFrame({'name': ['alisa', 'kat', 'sonya'], 'age': [14, 16, 17], 'school': ['capitol', 'North', 'North']})

In [45]:
df

    name  age   school
0  alisa   14  capitol
1    kat   16    North
2  sonya   17    North

In [46]:
#tells you what datatype
df.dtypes

name      object
age        int64
school    object
dtype: object

In [47]:
#locate a value, row then column
df.loc[1, 'age']

16

In [48]:
df.iloc[1, 1]

16

In [49]:
df.loc[1:, ['name', 'school']]

    name school
1    kat  North
2  sonya  North

In [50]:
df.iloc[1:, [0, 2]]

    name school
1    kat  North
2  sonya  North

In [13]:
#tells you the max number
df.age.max()

17

In [14]:
df.age

0    14
1    16
2    17
Name: age, dtype: int64

In [15]:
#give conditions using [] to subset the data frame
df[(df.age >15) & (df.age<18)]

    name  age school
1    kat   16  North
2  sonya   17  North

In [16]:
df[df.age == df.age.max()]['name']

2    sonya
Name: name, dtype: object

In [17]:
#give conditon and it will tell you true or false
df.age > 15

0    False
1     True
2     True
Name: age, dtype: bool

In [18]:
# df['is_dependent'] = 'Yes'
df['is_dependent'] = (df.age > 15)

In [19]:
df

    name  age   school  is_dependent
0  alisa   14  capitol         False
1    kat   16    North          True
2  sonya   17    North          True

In [20]:
df['is_dependent_new'] = df.is_dependent.map({True: 'Yes', False: 'No'})
df

    name  age   school  is_dependent is_dependent_new
0  alisa   14  capitol         False               No
1    kat   16    North          True              Yes
2  sonya   17    North          True              Yes

In [21]:
#can create a new column
df['last_name'] = 'zhong'
df

    name  age   school  is_dependent is_dependent_new last_name
0  alisa   14  capitol         False               No     zhong
1    kat   16    North          True              Yes     zhong
2  sonya   17    North          True              Yes     zhong

In [22]:
df['last_name'] = 'zong'

In [23]:
# df['is_dependent_new']
df[(df.is_dependent_new == 'Yes')]

    name  age school  is_dependent is_dependent_new last_name
1    kat   16  North          True              Yes      zong
2  sonya   17  North          True              Yes      zong

In [24]:
df[df.is_dependent_new == 'Yes']

    name  age school  is_dependent is_dependent_new last_name
1    kat   16  North          True              Yes      zong
2  sonya   17  North          True              Yes      zong

In [25]:
df.loc[df.school == 'North', ['name', 'school']]
# df['name']

    name school
1    kat  North
2  sonya  North

In [26]:
df[df.school == 'North']

    name  age school  is_dependent is_dependent_new last_name
1    kat   16  North          True              Yes      zong
2  sonya   17  North          True              Yes      zong

In [27]:
df.loc[[1,2], ['name', 'school']]

    name school
1    kat  North
2  sonya  North

In [28]:
df.age.shift()

0     NaN
1    14.0
2    16.0
Name: age, dtype: float64

In [29]:
stock = pd.DataFrame({'name': ['APPL']*10,  'close': range(2, 12)})
stock

# stock['shift'] = stock['close'].shift()
# stock['profit'] = stock['close'] - stock['shift']
# stock

   name  close
0  APPL      2
1  APPL      3
2  APPL      4
3  APPL      5
4  APPL      6
5  APPL      7
6  APPL      8
7  APPL      9
8  APPL     10
9  APPL     11

In [30]:
#bins lets you sort in specific ranges such as smaller than 5, between 5 and 9, and greater than 9
stock['bins'] = pd.cut(stock['close'], [0, 5, 9, 100], labels=['<=5', '5-9', '>9'])
stock

   name  close bins
0  APPL      2  <=5
1  APPL      3  <=5
2  APPL      4  <=5
3  APPL      5  <=5
4  APPL      6  5-9
5  APPL      7  5-9
6  APPL      8  5-9
7  APPL      9  5-9
8  APPL     10   >9
9  APPL     11   >9

In [31]:
stock[stock['close'] < 5]

   name  close bins
0  APPL      2  <=5
1  APPL      3  <=5
2  APPL      4  <=5

In [32]:
df.loc[3, :] = ['owen', 4, 'home', False, 'No', 'zong']

In [33]:
df

    name   age   school is_dependent is_dependent_new last_name
0  alisa  14.0  capitol        False               No      zong
1    kat  16.0    North         True              Yes      zong
2  sonya  17.0    North         True              Yes      zong
3   owen   4.0     home        False               No      zong

In [34]:
df.append??

In [35]:
df.append(df)

    name   age   school is_dependent is_dependent_new last_name
0  alisa  14.0  capitol        False               No      zong
1    kat  16.0    North         True              Yes      zong
2  sonya  17.0    North         True              Yes      zong
3   owen   4.0     home        False               No      zong
0  alisa  14.0  capitol        False               No      zong
1    kat  16.0    North         True              Yes      zong
2  sonya  17.0    North         True              Yes      zong
3   owen   4.0     home        False               No      zong

In [36]:
pd.concat([df, df])

    name   age   school is_dependent is_dependent_new last_name
0  alisa  14.0  capitol        False               No      zong
1    kat  16.0    North         True              Yes      zong
2  sonya  17.0    North         True              Yes      zong
3   owen   4.0     home        False               No      zong
0  alisa  14.0  capitol        False               No      zong
1    kat  16.0    North         True              Yes      zong
2  sonya  17.0    North         True              Yes      zong
3   owen   4.0     home        False               No      zong